
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Сообщение = "Поменялась цена";

	РассчетСуммы(ТекДанные, Сообщение);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Сообщение = "Поменялось количество";

	РассчетСуммы(ТекДанные, Сообщение);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчетСуммы(Строка, Текст)

	Строка.Сумма = Строка.Количество * Строка.Цена;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

	Человек = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Человек.Имя;
	Сообщение.Сообщить();



КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()
	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Имя", "Антон");
	Сотрудник.Вставить("Стаж", 15);
	Сотрудник.Вставить("ДатаПриема", ТекущаяДата());
	Сотрудник.Вставить("Штатный", Истина);

	Возврат Сотрудник;

КонецФункции

#КонецОбласти